Repository: addictadev/stat_doctor_mobile
Catalog: assets/translation/*.arb
Languages: ar, fr

# errorFieldRequired
source: This field is required
ar: هذا الحقل مطلوب
fr: Ce champ est obligatoire

# errorInvalidName
source: Invalid name format
ar: تنسيق الاسم غير صحيح
fr: Format du nom invalide

# errorInvalidUrl
source: Invalid URL
ar: عنوان URL غير صالح
fr: URL invalide

# errorInvalidEmail
source: Invalid email address
ar: عنوان البريد الإلكتروني غير صحيح
fr: Adresse e-mail invalide

# errorInvalidPassword
source: Password must be at least 8 characters long with uppercase, lowercase, and special characters
ar: يجب أن تحتوي كلمة المرور على 8 أحرف على الأقل مع أحرف كبيرة وصغيرة ورموز خاصة
fr: Le mot de passe doit contenir au moins 8 caractères avec majuscule, minuscule et caractères spéciaux

# errorPasswordMismatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين
fr: Les mots de passe ne correspondent pas

# errorInvalidNumber
source: Invalid number
ar: رقم غير صالح
fr: Numéro invalide

# errorInvalidIban
source: Invalid IBAN format
ar: تنسيق IBAN غير صالح
fr: Format IBAN invalide

# errorInvalidMobileNumber
source: Invalid mobile number
ar: رقم الجوال غير صالح
fr: Numéro mobile invalide

# errorInvalidStcPayId
source: Invalid STC Pay ID
ar: معرف STC Pay غير صالح
fr: Identifiant STC Pay invalide

# errorInvalidNationalId
source: Invalid National ID
ar: رقم الهوية الوطنية غير صالح
fr: Numéro d'identité nationale invalide

# errorInvalidPassport
source: Invalid passport number
ar: رقم جواز السفر غير صالح
fr: Numéro de passeport invalide

# errorNoInternetConnection
source: No internet connection available. Please check your network settings and try again.
ar: لا يوجد اتصال بالإنترنت. يرجى التحقق من إعدادات الشبكة والمحاولة مرة أخرى.
fr: Aucune connexion Internet disponible. Veuillez vérifier vos paramètres réseau et réessayer.

# errorConnectionTimedOut
source: Connection timed out. Please check your internet connection and try again.
ar: انتهت مهلة الاتصال. يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.
fr: Délai de connexion dépassé. Veuillez vérifier votre connexion Internet et réessayer.

# errorSessionExpired
source: Your session has expired. Please log in again to continue.
ar: انتهت صلاحية جلستك. يرجى تسجيل الدخول مرة أخرى للمتابعة.
fr: Votre session a expiré. Veuillez vous reconnecter pour continuer.

# errorUnknownServerError
source: An unknown server error occurred. Please try again later or contact support if the problem persists.
ar: حدث خطأ غير معروف في الخادم. يرجى المحاولة مرة أخرى لاحقًا أو التواصل مع الدعم إذا استمرت المشكلة.
fr: Une erreur serveur inconnue s'est produite. Veuillez réessayer plus tard ou contacter le support si le problème persiste.

# errorUnexpectedError
source: An unexpected error occurred. Please try again or contact support if the problem continues.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى أو التواصل مع الدعم إذا استمرت المشكلة.
fr: Une erreur inattendue s'est produite. Veuillez réessayer ou contacter le support si le problème persiste.

# noResults
source: Oops! No Results
ar: عذرًا! لا توجد نتائج
fr: Oups ! Aucun résultat

# noDataToDisplay
source: No data to display at the moment.
ar: لا توجد بيانات للعرض حاليًا.
fr: Aucune donnée à afficher pour le moment.

source: Retry
ar: إعادة المحاولة
fr: Réessayer

source: Try Again
ar: حاول مرة أخرى
fr: Essayer à nouveau

# uploadChooseImage
source: Choose Image
ar: اختر صورة
fr: Choisir une image

# uploadTakePicture
source: Take Picture
ar: التقط صورة
fr: Prendre une photo

# uploadChooseFromFiles
source: Choose From Files
ar: اختر من الملفات
fr: Choisir à partir des fichiers
